package com.example.hello;

import android.content.Intent;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.text.TextUtils;
import android.view.View;
import android.widget.Button;
import android.widget.EditText;
import android.widget.TextView;
import android.widget.Toast;


import com.google.firebase.FirebaseApp;
import com.google.firebase.auth.FirebaseAuth;
import com.google.firebase.auth.FirebaseUser;
import com.google.firebase.database.DatabaseReference;
import com.google.firebase.database.FirebaseDatabase;
import com.google.firebase.database.DatabaseException;

import java.util.Random;
import java.util.UUID;


public class MainActivity extends AppCompatActivity {

      TextView Result;
      TextView Result2;
      EditText nickname1;
      EditText nickname2;
      Button save;

   DatabaseReference databaseSpele; // nosauc datubazi

     @Override
    protected void onCreate(Bundle savedInstanceState) {
       // FirebaseDatabase.getInstance().setPersistenceEnabled(true);
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main);

        //FirebaseDatabase.getInstance().setPersistenceEnabled(true); // savieno offline database

        FirebaseUser user = FirebaseAuth.getInstance().getCurrentUser();
        String uid = ((FirebaseUser) user).getUid();



        databaseSpele =  FirebaseDatabase.getInstance().getReference("Spele").child(uid); //kada ir datubaze


        nickname1 = (EditText) findViewById(R.id.nickname1);
        nickname2 = (EditText)findViewById(R.id.nickname2);
        save = (Button) findViewById(R.id.save);
        Result = (TextView)findViewById(R.id.Result);
        Result2 = (TextView)findViewById(R.id.Result2);

        save.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                saves();
            }
        });
    }

        private void saves(){
        String nick = nickname1.getText().toString().trim();
        String result = Result.getText().toString().trim();

        String nick2 = nickname2.getText().toString().trim();
        String result2 = Result2.getText().toString().trim();

        if(!TextUtils.isEmpty(nick)){
            if(!TextUtils.isEmpty(nick2)) {
                String id = databaseSpele.push().getKey();


                Nicks nicks = new Nicks(nick, result, nick2, result2);

                databaseSpele.child(id).setValue(nicks);

                Toast.makeText(this, "Nick added", Toast.LENGTH_LONG).show();
            }else{
                Toast.makeText(this,"You shood enter a nickname", Toast.LENGTH_LONG).show();
            }

        }else{
            Toast.makeText(this,"You shood enter a nickname", Toast.LENGTH_LONG).show();
        }
        }



    int resSum = 0;
    int resSum2 = 0;

     public void onButtonClick3(View n){
        String[] words = {"СОЛНЦЕ","ХЛЕБ","КЛУБ","БУХГАЛТЕР","СЫН","ДОМ",
                "ДАЧА","ЯБЛОКИ","МАГАЗИН","ПЛЯЖ","ЛОДКА","ЦЕНТР",
                "БУМЕР","ЗАБЫТЬ","АНДРЕЙ","МАЛЬЧИК","ПОЛКОВНИК",
                "ДОРОГА","ЗЕМЛЯ","ЮПИТЕР","ЛЕД","СНЕГ","ДОЖДЬ",
                "ПОГОДА","МЕДВЕДЬ","КОТ","СОБАКА","ЧЕЛОВЕК","ГИТАРА",
                "МИР","СКАЛА","БАТАРЕЙКА","ЦВЕТЫ","КНИГА","АБОНЕМЕНТ",
                "БАССЕЙН","ВАЛЕНКИ","КАЧОК","ИВА","ДЫМ","СИГАРЕТ",
                "ОГОНЬ","НОЧЬ","ДЕНЬ","ДЕВОЧКА","ЗЕЛЕНЫЙ","КРАСНЫЙ",
                "СИНИЙ","ЖЁЛТЫЙ","МАЛИНА","КЛУБНИКА","КАМЫШ","КОЛОДЕЦ",
                "КОРОВА","ЛАНДЫШ","ГОВНОВОЗ","ГОДА","КОСА","МОНЕТА",
                "ДУМАЮ","НОМЕР","ОБОИ","ПАСПОРТ","ПАТРОН","УЛИЦА",
                "АПЕЛЬСИН","АЭРОПОРТ","АТТЕСТАТ","ГЕРОИНЯ","ОНЛАЙН",
                "ТОЛЬКО","РЮМКА","ВОДКА","СТАКАН","ОБЛАКА","ЗЕРКАЛО",
                "ГОЛОВА","НОГИ","ТАНЦПОЛ","ФАНТАЗЕР","ВЫХОД","РАССВЕТ",
                "ЗАКАТ","ПАЛАТКА","МОЛОТОК","ТАПКИ","СНЕГИРЬ","ТАНК","ВОЙНА",
                "ДУНАЙ","РЕКА","БЕРЕЗА","ЛИСТ","ОРАНЖЕВЫЙ","ВАГОН","ДЕНЬ","МЕДУЗА",
                "ВОДА","ЦВЕТ","НАСТРОЕНИЕ","ТАНЦЫ","РОССИЯ","СТРАНА","ГОРЫ","ЗАРЯ",
                "РЫБАЛКА","РЫБА","НЕБОСКРЕБ","КЕНТ","ПАЦАН","ИСТОК","Я","ТЫ",
                "СЕМЬЯ","КОЛЕНИ","МОЛОДОСТЬ","ТАМАДА","ХАЛАТ","РОЖДЕНИЕ",
                "ВЕЧЕР","УТРО","БОГ","НОГИ","ДИМОН","КАЛЕНДАРЬ",
                "ЯНВАРЬ","ФЕВРАЛЬ","МАРТ","АПРЕЛЬ","МАЙ","ИЮНЬ",
                "ИЮЛЬ","АВГУСТ","СЕНТЯБРЬ","ОКТЯБРЬ","НОЯБРЬ","ДЕКАБРЬ",
                "МОСКВА","СОЧИ","РАЙОН","КВАРТАЛ","ЛЮБОВЬ","",
                "ПИВО","РОЗЫ","ТЮЛЬПАНЫ","СЕРДЦЕ","ОСЕНЬ","ЛЕТО",
                "ЗИМА","ВЕСНА","ГАРМОНЬ","КАЗАК","ГОЛУБЬ","ЗВЕЗДА",
                "ВОЗРАСТ","ЗДАНИЕ","ЗУБ","ПРИЧИНА","МЕЧТА","МЕЛОМАН",
                "ЛУЖА","ПИТЕР","СУЛТАН","ВОРОН","МАШИНА","ОСТАНОВКА",
                "БИЛЕТ","ОКЕАН","ПЛАТЬЕ","ЮБКА","ПЕШЕХОД","ВОДА",
                "АСФАЛЬТ","ЯСЕНЬ","ДРУЗЬЯ","КРЫША","КОВЁР","РОЛЬ",
                "СЕДИНА","ПОПЫТКА","СЕКРЕТ","СВЕТ","ТЬМА","КЕДЫ",
                "ПЫЛЬ","СЫН","ДОЧЬ","СЛОВО","СТЕПЬ","ПОБЕДА",
                "ПТИЦА","ДЕТСТВО","КОРАБЛЬ","АРМИЯ","ЗДОРОВЬЕ","АМСТЕРДАМ",
                "ЛАБУТЕНЫ","ИГРА","НЕДЕЛЯ","МЕСЯЦ","ГОД","МЕЛЬНИЦА",
                "ТУМАН","СИБИРЬ","КАВКАЗ","СВЕЧА","БЕГУДИ","ЛОПАТА",
                "ПЕЛЬМЕНИ","РЕЛЬСЫ","ДОН","СУДЬБА","ЛУНА","РАК",
                "ДЕД","ЧЕМОДАН","СОН","ЗАВТРА","ВЧЕРА","ТУЧА",
                "ДЬЯВОЛ","ДУША","КАЛЫМ","САМОЛЕТ","ТОПОЛЬ","ПУХ",
                "БРАТ","СЕСТРА","ЛЕС","ВЗГЛЯД","НАПИТОК","ШКОЛА",
                "КОМПЬЮТЕР","ТЕЛЕФОН","КАЧЕЛИ","БАТАЛЬОН","ЦЕНА","КЛЁН",
                "САД","ВИТАМИН","ИМЯ","БЕЛЫЙ","ЧЕРНЫЙ","КОМАНДА",
                "ГОРОД","РОДИНА","ДВЕРЬ","КОЛЫМА","ОТЕЦ","МАТЬ",
                "МАГАДАН","ОЧАГ","ДОБРО","ЗЛО","АДРЕС","КАДЕТ",
                "СЛУЖБА","ПОКЕМОН","ПОРОХ","САПОГ","ЖУРАВЛИ","ВЕТЕР",
                "ПЕСОК","ВОЛНА","АРИФМЕТИКА","СКАЗКА","РОБОТ","ПУСТЫНЯ",
                "БАРАБАН","ЗОНА","УЗЕЛ","СВОЛОЧЬ","ПЕСНЯ","ПЯТНИЦА",
                "ШАМПАНСКОЕ","ПАРК","СОЛДАТ","УЛЫБКА","ЧАС","ДВОР",
                "ИСПЫТАНИЕ","КУПОЛ","СКАМЬЯ","СКВОРЕЦ","ВРАГ","МОСТ",
                "БЕРЛИН","МИША","СОЮЗ","ДЮТИФРИ","КРЕЙСЕР","ЯЗЫК",
                "ГЕОГРАФИЯ","ЖИЗНЬ","ГРУША","БЕРЕГ","ПИСЬМО","ОРЁЛ","СТЕПЬ","ГЛАЗА",
                "СОВА","ВОЛК","КАПИТАН","МОРЯК","ГОРА","КУЗНЕЧИК",
                "ТИШИНА","ПАРУС","ВРАГ","ФИАЛКА","БРЕЛОК","МГНОВЕНИЕ",
                "ХОККЕЙ","ГИМНАСТИКА","КЛОУН","КАРЛИК","НОМЕР","КАЛИНА",
                "ПАРОВОЗ","ПУТЬ","РОЗА","МИЛЛИОН","ТЁТЯ","ОРБИТ",
                "КЛЮЧ","ВЕН","РУКАВ","СУГРОБ","ПЛАТОК","КИЕВ",
                "СЕРЕБРО","ПОДОШВА","ФОБИЯ","ГРОБ","ШКОЛА","ГЕПАРД",
                "ПАНИКА","ТИТАНИК","СТРЕЛА","АМУР","РУКА","ШАШЛЫК",
                "ДИДЖЕЙ","АЛЛЕЯ","БАБОЧКА","БАНАН","СЕЛО","КАРТОШКА",
                "ЛОПАТА","ОЛЕНЬ","ЕЛКА","ПЛАН","КАТЕТ","ГИПОТЕНУЗА",
                "ПАРК","ПАРУС","БОРОДА","ТОЧКА","СПЕКТАКЛЬ","ЙОГУРТЫ",
                "ГУБЫ","РАЙ","КОРОЛЕВА","ТАКСИ","ЧУДО","ТЕПЛОХОД",
                "БЕРЕГ","ЛЕПЕСТКИ","ПАРОЛЬ","ОРИЕНТИР","МЕЛ","БОЛЬ",
                "СТРАНИЦА","ЦЕНА","ЦЕЛЬ","ЗОЛОТО","СТУДЕНТ","ВЕСЛО",
                "ОШИБКА","ГЕНЕРАЛ","ЗАВОД","ПАМЯТЬ","ГАЗЕТА","КАДР",
                "ПЛАНЕТА","ЖЕЛАНИЕ","ИЗБУШКА","МИНУТА","КРАСКА","УРОК",
                "СТОЛИЦА","ВОПРОС","СУДЬБА","ПОПУТЧИЦА","ПОЛОСА","НЕБЕСА",
                "СТЕКЛО","ЗВЕЗДА","ТРАМВАЙ","ПОГОН","ПОХОДКА","РАДИО",
                "ПОЭТ","ЛАДОНЬ","КУЛАК","ГУБ","ШЁПОТ","КОНФЕТА",
                "ЗЕФИР","ДУХИ","ХЛОПУШКА","ЧАСИКИ","ГРУСТЬ","ЧАСОВОЙ",
                "КАРУСЕЛЬ","МОНЕТА","КОКОС","АПЕЛЬСИН","ВЕТЕР","ИСКРА",
                "РЕСНИЦА","ХОЗЯИН","СИРЕНА","СИРЕНЬ","ТАНЕЦ","КАПЕЛЬ",
                "РУЧЕЁК","КРЫЛЬЯ","КАЗАНОВА","КАРНАВАЛ","СКАНДАЛ","МАСКА",
                "ПОСТУПОК","ЛОГИКА","ДВИЖЕНЬЕ","СУМЕРКИ","ПРИТЯЖЕНЬЕ","ПАЛЕЦ",
                "ФИНИШ","ПЕРЕМЕНА","ЗАКОН","БОТИНКИ","СЮЖЕТ","АВТОСТОП",
                "ХОРОШО","ЛАДОШКА","МАДАМ","ЗАБОТА","ТЕЛО","ЧАША",
                "ЧАЙ","КОФЕ","ШОКОЛАД","РАСКЛАД","ВЕТКА","ОБМАН",
                "БРИЛЛИАНТ","ЛУЧ","ПРАВДА","ЛОЖЬ","СЛАБОСТЬ","СИГНАЛ",
                "МЕСТЬ","ПОЛНОЛУНИЕ","ШАГ","НАГРАДА","ПОДРУГА","ЛУНАТИК",
                "ФАРА","КУКЛОВОД","ТИТРЫ","РАДУГА","РОМАН","КРОВ",
                "ЧУЖБИНА","ФРОНТОВИК","ГЕРОЙ","ФЛАГ","РОЛЬ","ГРОЗА",
                "ТУМАН","ПОТ","ЖЕНИХ","НЕВЕСТА","КНИГ","ФОРМА",
                "ЗЕМЛЯНКА","КУРСК","ВОРОТА","БАТАЛЬОН","РАКЕТА","РЕБЯТА",
                "ГРЯЗЬ","ИГОЛКА","КРОКОДИЛ","ДУША","МАКУШКА","РАНА",
                "СОЛЬ","ТРУБКА","МУЖИЧКИ","ОКНА","КАБЛУЧКИ","ПОДМОСКОВЬЕ",
                "ОПА","ЕВРОПА","СЕРЕЖКИ","МИЛЛИОН","ПЕПЕЛ","ДЫХАНЬЕ",
                "ПЛАМЯ","ПУЛЬС","КАТОК","КРУГ","ДОСТУП","СПАСАТЕЛЬ",
                "ВОДОПАД","ЗАПОЙ","ГОСПОДЬ","НАРКОТИК","ЗОНТ","ВИНО",
                "ПИВО","ТАЧКА","ТЕЛЕВИЗОР","СЧАСТЬЕ","ВРАЧ","ОРДЕН",
                "РАНА","МОСТ","ПРОСТИ","ВЬЮГА","ТОСКА","СПИНА",
                "ВЕРА","ВЗГЛЯД","СТРАХ","ГРИМАСА","СМЕХ","ГРАНИЦА",
                "ПРОСПЕКТ","НАПОЛЕОН","ПАГАНИНИ","АМБИЦИЯ","КОМЕТА","НОТА",
                "КИЛОМЕТР","ВЫСОТА","ТРАССА","СТРОКА","ПРИЧАЛ","МАЯК",
                "ЭТАЖ","ОПУШКА","ПОТОЛОК","ПОРОГ","ИНЕЙ","ОХОТА",
                "УЧЕНЫЙ","КЛЮЧ","ИГРУШКА","РОГА","СЛЕД","МЕТЛА",
                "ЧЕРТОВЩИНА","ЧЁРТ","БРЮШКО","ЛЯГУШКА","МУХА","ХОР",
                "ПЕРЕПЁЛКА","ДОЩЕЧКА","ЛЕСЕНКА","АРОМАТ","МЕТЕЛЬ","ДЕД МОРОЗ",
                "МУДРО","ДРУЖБА","ПОЛДЕНЬ","ПРИЗВАНЬЕ","ВЕЛИКАН","СНЕГУРОЧКА",
                "УТЯТА","СКРИПКА","НЕБОСВОД","НОСОРОГ","ЛЬВЁНОК","ПРОТЕИНЫ",
                "АНАБОЛИК","ЛИТВА","СИБИРЬ","АНТАЛИЯ","РИТМ","АВАРИЯ",
                "МЕЛОДИЯ","КОМУНАЛЬНАЯ","КВАРТИРА","БРАТВА","ТУНДРА","МУХОМОР",
                "ПОДВОРОТНЯ","СВЕТОФОР","КАССЕТЫ","БРЫЗГИ","ОСКОЛКИ","ЗРАЧКИ",
                "ПАРИЖ","МИЛАН","РОСТОВ","КАЗАНЬ","ДЕЛА","ЭХО",
                "ДУРМАН","СВАДЬБА","КОЛЬЦО","УКРАШЕНЬЕ","ВЕРНИСАЖ","ПОРТРЕТ",
                "ПЕЙЗАЖ","АКАПУЛЬКО","БАРАБАН","ВИТРИНА","НАСМЕШКА","ТАЙНА",
                "ПОКОЙ","СМОРОДИНА","АЛЯСКА","БАНЯ","ЛОСОСЬ","РУБАХА",
                "КОРОНА","ИМПЕРИЯ","КАЛИТКА","КНОПОЧКИ","МАХОРКА","ПАТРОНЫ",
                "КОМБАТ","БАТАРЕЯ","СВАДЬБА","ДЕСАНТ","АГРЕГАТ","КИЛОВАТТ",
                "ВОЛГА","ЕНИСЕЙ","ПУХ","ПЕРО","БИДОН","ДВОР",
                "ГАГАРИН","БЕСЕДА","ГОРИЗОНТ","СЕВАСТОПОЛЬ","СОМНЕНЬЯ","СЛУЧАЙ",
                "ВОЗРАСТ","ПОСТЕЛЬ","ПУЛЬС","ОТРАЖЕНИЕ","БУКЕТ","ПЛАНЕТА",
                "ЭНДОРФИН","БАЛКОНЕ","ГОРЛО","КАЗАРМА","АРМИЯ","ВОЕНКОМАТ",
                "МЕТРО","РЕКЛАМА","ИДЕЯ","ОБИДА","МОТЫЛЁК","ОТЕЛЬ",
                "ЧИПСЫ","ВЕЛОСИПЕД","ПОКОЛЕНИЕ","КЛИП","МОЗГ","КОНВЕРТ",
                "НИКОТИН","ЧЕМОДАН","НАВИГАТОР","РЕМЕСЛО","КОЖА","МЕШОК",
                "РОДДОМ","ТЁЩА","ТЕСТЬ","КЛУБ","ЧЕРЕПАХА","ТРУЩОБЫ",
                "ОЧАГ","БЛОНДИН","ТОЛПА","ТРОН","ТИГР","",
                "ПАРАХОД","НЕГР","ФРУКТ","БОРЩ","АФРИКА",
                "МЕСТО","ЧЕМПИОН","ПОЧЕРК","ПРОСТУДА","РАЗУМ","ОБЛИК",
                "СООБЩЕНИЯ","ОБЩЕНИЕ","КРИК","УСПЕХ","ТОННЕЛЬ","ВЫБОР",
                "ОПЫТ","ТОЧКА","ЗВУК","НЕТ","ДА","ИТОГ",
                "МЕЛОМАН","СТИХ","ДЕНЬГИ"};

        Random generator = new Random();
        int randomIndex=generator.nextInt(words.length);

        TextView resText = (TextView)findViewById(R.id.textView);
        resText.setText(words[randomIndex]);


    }

    public void onButtonClick(View v) {


        TextView resText = (TextView) findViewById(R.id.Result);

        resSum = resSum + 1;
        resText.setText(Integer.toString(resSum));
    }

    public void onButtonClick2(View v) {

        TextView resText = (TextView) findViewById(R.id.Result2);

        resSum2 = resSum2 + 1;
        resText.setText(Integer.toString(resSum2));
    }

    public void onButtonClickRestart(View v){
        resSum = 0;
        resSum2 = 0;
        TextView word = (TextView)findViewById(R.id.textView);
        word.setText("СЛОВО");
        TextView resText = (TextView) findViewById(R.id.Result);
        TextView wesText = (TextView) findViewById(R.id.Result2);
        resText.setText(Integer.toString(resSum));
        wesText.setText(Integer.toString(resSum2));

    }

    public void onButtonClickBack(View v){
        finish();
    }


}


